{
  "nodes": [
    {
      "op": "null", 
      "name": "relu4_3_scale", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 20}]", 
        "__shape__": "(1, 512, 1, 1)", 
        "__wd_mult__": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "relu4_3_norm", 
      "attrs": {"mode": "channel"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[0, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "relu4_3_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "relu4_3_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "relu4_3_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu5_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc6_weight", 
      "attrs": {
        "dilate": "(6, 6)", 
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(6, 6)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc6_bias", 
      "attrs": {
        "dilate": "(6, 6)", 
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(6, 6)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fc6", 
      "attrs": {
        "dilate": "(6, 6)", 
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(6, 6)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc7_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1024", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc7_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1024", 
        "pad": "(0, 0)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "fc7", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1024", 
        "pad": "(0, 0)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "relu7_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "relu7_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "relu7_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose3", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten5", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_1x1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_1x1_conv_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_2_conv_1x1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_2_conv_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_2_conv_3x3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_2_conv_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_relu_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_relu_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_2_conv_3x3_relu_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose5", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten8", 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_1x1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_1x1_conv_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_3_conv_1x1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_3_conv_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_3_conv_3x3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_3_conv_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_relu_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_relu_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_3_conv_3x3_relu_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "12", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose7", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten11", 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_1x1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_1x1_conv_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_4_conv_1x1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_4_conv_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_4_conv_3x3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_4_conv_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_relu_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_relu_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_4_conv_3x3_relu_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose9", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten14", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_1x1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_1x1_conv_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_5_conv_1x1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_5_conv_1x1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_conv_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_5_conv_3x3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "multi_feat_5_conv_3x3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_relu_cls_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_relu_cls_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_5_conv_3x3_relu_cls_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose11", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten17", 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "6"
      }, 
      "inputs": [[51, 0, 0], [78, 0, 0], [91, 0, 0], [104, 0, 0], [117, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, -1, 2)"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "multibox_cls_pred", 
      "attrs": {"axes": "(0, 2, 1)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "cls_prob", 
      "attrs": {"mode": "channel"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "relu4_3_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "relu4_3_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "relu4_3_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "relu7_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "relu7_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "relu7_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[73, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten4", 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_relu_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_2_conv_3x3_relu_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_2_conv_3x3_relu_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[86, 0, 0], [145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose4", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten7", 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_relu_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_3_conv_3x3_relu_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_3_conv_3x3_relu_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[99, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose6", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten10", 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_relu_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_4_conv_3x3_relu_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_4_conv_3x3_relu_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose8", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten13", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_relu_loc_pred_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "multi_feat_5_conv_3x3_relu_loc_pred_conv_bias", 
      "attrs": {
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "2.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "multi_feat_5_conv_3x3_relu_loc_pred_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[125, 0, 0], [160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose10", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten16", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "multibox_loc_pred", 
      "attrs": {
        "dim": "1", 
        "num_args": "6"
      }, 
      "inputs": [[139, 0, 0], [144, 0, 0], [149, 0, 0], [154, 0, 0], [159, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "relu4_3_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5)", 
        "sizes": "(0.1,0.141)", 
        "steps": "(0.02666666666666667, 0.02666666666666667)"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten3", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "relu7_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5,3,0.3333333333333333)", 
        "sizes": "(0.2,0.272)", 
        "steps": "(0.05333333333333334, 0.05333333333333334)"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten6", 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "multi_feat_2_conv_3x3_relu_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5,3,0.3333333333333333)", 
        "sizes": "(0.37,0.447)", 
        "steps": "(0.10666666666666667, 0.10666666666666667)"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten9", 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "multi_feat_3_conv_3x3_relu_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5,3,0.3333333333333333)", 
        "sizes": "(0.54,0.619)", 
        "steps": "(0.21333333333333335, 0.21333333333333335)"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten12", 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "multi_feat_4_conv_3x3_relu_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5)", 
        "sizes": "(0.71,0.79)", 
        "steps": "(0.3333333333333333, 0.3333333333333333)"
      }, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten15", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxPrior", 
      "name": "multi_feat_5_conv_3x3_relu_anchors", 
      "attrs": {
        "clip": "False", 
        "ratios": "(1,2,0.5)", 
        "sizes": "(0.88,0.961)", 
        "steps": "(1.0, 1.0)"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten18", 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "6"
      }, 
      "inputs": [[167, 0, 0], [169, 0, 0], [171, 0, 0], [173, 0, 0], [175, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "multibox_anchors", 
      "attrs": {"shape": "(0, -1, 4)"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "_contrib_MultiBoxDetection", 
      "name": "detection", 
      "attrs": {
        "force_suppress": "True", 
        "nms_threshold": "0.5", 
        "nms_topk": "400", 
        "variances": "(0.1, 0.1, 0.2, 0.2)"
      }, 
      "inputs": [[134, 0, 0], [165, 0, 0], [179, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    11, 
    12, 
    15, 
    16, 
    20, 
    21, 
    24, 
    25, 
    28, 
    29, 
    33, 
    34, 
    37, 
    38, 
    41, 
    42, 
    47, 
    48, 
    53, 
    54, 
    57, 
    58, 
    61, 
    62, 
    66, 
    67, 
    70, 
    71, 
    74, 
    75, 
    79, 
    80, 
    83, 
    84, 
    87, 
    88, 
    92, 
    93, 
    96, 
    97, 
    100, 
    101, 
    105, 
    106, 
    109, 
    110, 
    113, 
    114, 
    118, 
    119, 
    122, 
    123, 
    126, 
    127, 
    135, 
    136, 
    140, 
    141, 
    145, 
    146, 
    150, 
    151, 
    155, 
    156, 
    160, 
    161
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182
  ], 
  "heads": [[180, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10100]}
}